import pulp

prob = pulp.LpProblem("Виробництво напоїв", pulp.LpMaximize)
# Визначення змінних
x = pulp.LpVariable('x', lowBound=0, cat='Integer')  # лимонад
y = pulp.LpVariable('y', lowBound=0, cat='Integer')  # сік

# Цільова функція: максимізація загальної кількості продуктів
prob += x + y  # лимонад + фруктовий сік

# Обмеження на ресурси
prob += 2*x + y <= 100, "вода"
prob += x <= 50, "цукор"
prob += x <= 30, "лимонний сік"
prob += 2*y <= 40, "фруктове пюре"

prob.solve()

print("Оптимальне виробництво:")
print("Лимонад:", pulp.value(x))
print("Сік:", pulp.value(y))

print("Загально:", pulp.value(prob.objective))

# видає 30 лимонаду і 20 соку
# перевіряємо
# 30 лим = 60в + 30ц + 30с
# 20 соку = 20в + 40п
# загально = 80в + 30ц + 30с + 40п
# тобто залишилося 20в і 20ц
# чи можна зробити більше лимонаду? - ні, ми використали весь лимонний сік (с)
# чи можна зробити більше фруктового соку? - ні, ми використали все пюре (п)
